Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: SetTitleMatchMode - Syntax & Usage | AutoHotkey v2
ja: SetTitleMatchMode - 構文と使用法｜AutoHotkey v2

source: SetTitleMatchMode 2 ; Avoids the need to specify the full path of the file below.
ja: SetTitleMatchMode 2 ; 以下、ファイルのフルパスを指定する必要を回避することができます。

source: SetWinDelay - Syntax & Usage | AutoHotkey v2
ja: SetWinDelay - 構文と使用法｜AutoHotkey v2

source: SetWorkingDir - Syntax & Usage | AutoHotkey v2
ja: SetWorkingDir - 構文と使用法｜AutoHotkey v2

source: Sets BackspaceIsUndo to false, which causes Backspace to be ignored.
ja: BackspaceIsUndoをfalseに設定し、Backspaceを無視するようにします。

source: Sets CaseSensitive to true, making MatchList case sensitive.
ja: CaseSensitiveをtrueに設定し、MatchListの大文字小文字を区別するようにします。

source: Sets FindAnywhere to 1 (true), allowing matches to be found anywhere within what the user types.
ja: FindAnywhereを1 (true)に設定し、ユーザーが入力した内容のどこにでもマッチを見つけることができるようにします。

source: Sets FindAnywhere to true, allowing matches to be found anywhere within what the user types.
ja: FindAnywhereをtrueに設定し、ユーザーが入力した内容のどこにでもマッチを見つけることができるようにします。

source: Sets MinSendLevel to 1 or a given value, causing any input with send level below this value to be ignored.
ja: MinSendLevelを1または所定の値に設定し、この値以下の送信レベルを持つ入力は無視されるようにします。

source: Sets Timeout (e.g. T3 or T2.5).
ja: タイムアウトを設定します（例：T3またはT2.5）。

source: Sets VisibleText and VisibleNonText to true.
ja: VisibleText、VisibleNonTextをtrueに設定します。

source: Sets Console mode.
ja: コンソールモードを設定する。

source: Sets a miscellaneous property.
ja: 雑多なプロパティを設定する。

source: Sets a user variable.
ja: ユーザー変数を設定する。

source: Sets an .exe property.
ja: .exe プロパティを設定します。

source: Sets an object's base object.
ja: オブジェクトのベースとなるオブジェクトを設定します。

source: Sets blank criteria (turns off context-sensitivity).
ja: 空白の条件を設定します（文脈依存性をオフにします）。

source: Sets coordinate mode for various built-in functions to be relative to either the active window or the screen.
ja: 各種内蔵機能の座標モードを、アクティブウィンドウまたはスクリーンに対する相対座標に設定します。

source: Sets input focus to a given control on a window.
ja: ウィンドウ上の指定されたコントロールに入力フォーカスを設定します。

source: Sets items.
ja: 項目を設定します。

source: Sets keyboard focus to the control.
ja: コントロールにキーボードフォーカスを設定します。

source: Sets keyboard focus to the row (often used in conjunction with Select).
ja: キーボードフォーカスを行に設定します（Selectと併用されることが多いです）。

source: Sets master mute (on).
ja: マスターミュートを設定する（オン）。

source: Sets one or more options for the GUI window.
ja: GUIウィンドウのオプションを1つまたは複数設定します。

source: Sets options for a key or list of keys.
ja: キーまたはキーのリストに対するオプションを設定します。

source: Sets or replaces an ImageList for displaying icons, and returns the ImageListID that was previously associated with this control (or 0 if none).
ja: アイコンを表示するためのImageListを設定または置換し、このコントロールに以前関連付けられていた ImageListID を返します（ない場合は 0）。

source: Sets or replaces an ImageList for displaying icons.
ja: アイコンを表示するための ImageList を設定または置き換える。

source: Sets the #HotIf timeout to 10 ms instead of 1000 ms.
ja: #HotIfのタイムアウトを1000msではなく、10msに設定します。

source: Sets the uiAccess attribute in each UIA.exe file's embedded manifest.
ja: 各UIA.exeファイルの埋め込みマニフェストにuiAccess属性を設定します。

source: Sets the WS_BORDER style of the Notepad's Edit control to its opposite state.
ja: メモ帳の編集コントロールの WS_BORDER スタイルを反対の状態に設定します。

source: Sets the control's Name.
ja: コントロールのNameを設定します。

source: Sets the creation date.
ja: 作成日時を設定します。

source: Sets the criteria to a given function object.
ja: 与えられた関数オブジェクトに条件を設定します。

source: Sets the criteria to an existing #HotIf expression.
ja: 既存の #HotIf 式に条件を設定します。

source: Sets the current capacity of the object's internal array of own properties.
ja: オブジェクトの内部配列である自プロパティの現在の容量を設定します。

source: Sets the current folder as the default location to save scripts.
ja: スクリプトを保存するデフォルトの場所として、現在のフォルダを設定します。

source: Sets the default encoding for FileRead, Loop Read, FileAppend, and FileOpen.
ja: FileRead関数、Loop Read文、FileAppend関数、FileOpen関数のエンコード方法の初期値を設定します。

source: Sets the delay that will occur after each control-modifying function.
ja: 制御を変更する各機能の後に発生する遅延を設定します。

source: Sets the delay that will occur after each keystroke sent by Send or ControlSend.
ja: SendまたはControlSendでキーストロークを送信するたびに発生する遅延時間を設定します。

source: Sets the delay that will occur after each mouse movement or click.
ja: マウスの移動またはクリックの後に発生する遅延を設定します。

source: Sets the delay that will occur after each windowing function, such as WinActivate.
ja: WinActivateなどの各ウィンドウ機能後に発生する遅延時間を設定します。

source: Sets the display format of a DateTime control.
ja: DateTimeコントロールの表示形式を設定します。

source: Sets the font typeface, size, style, and/or color for controls added to the window from this point onward.
ja: これ以降にウィンドウに追加されるコントロールのフォントの書体、サイズ、スタイル、カラーを設定します。

source: Sets the font typeface, size, style, and/or color for the control.
ja: コントロールのフォントの書体、サイズ、スタイル、色などを設定します。

source: Sets the height of the items to an odd height with the TVM_SETITEMHEIGHT message.
ja: TVM_SETITEMHEIGHTメッセージでアイテムの高さを奇数に設定する。

source: Sets the hotkey modifier timeout to 100 ms instead of 50 ms.
ja: ホットキー修飾のタイムアウトを50msではなく、100msに設定します。

source: Sets the hotstring to the opposite state (enabled or disabled).
ja: ホットストリングを反対の状態（有効または無効）に設定します。

source: Sets the icon to be displayed next to MenuItemName.
ja: MenuItemNameの横に表示するアイコンを設定します。

source: Sets the icon to be displayed next to a menu item.
ja: メニュー項目の横に表示するアイコンを設定します。

source: Sets the input focus to the OK button.
ja: 入力フォーカスをOKボタンに設定します。

source: Sets the list-view window region to include only the item icons and text using SetWindowRgn.
ja: SetWindowRgnを使用して、リストビューのウィンドウ領域にアイテムのアイコンとテキストのみを含めるように設定します。

source: Sets the main icon.
ja: メインアイコンを設定する。

source: Sets the master volume to 50 percent.
ja: マスター音量を50パーセントにします。

source: Sets the master volume to 50 %.
ja: マスター音量を 50 % に設定します。

source: Sets the matching behavior of the WinTitle parameter in built-in functions such as WinWait.
ja: WinWaitなどの組み込み関数におけるWinTitleパラメータのマッチング動作を設定します。

source: Sets the maximum number of simultaneous threads per hotkey or hotstring.
ja: ホットキーまたはホットストリングごとの最大同時スレッド数を設定します。

source: Sets the maximum number of simultaneous threads.
ja: 最大同時スレッド数を設定します。

source: Sets the maximum time that may be spent evaluating a single #HotIf expression.
ja: 1つの#HotIf式を評価するのにかけられる最大時間を設定します。

source: Sets the method by which auto-replace hotstrings send their keystrokes.
ja: 自動置換ホットストリングがキー入力を送信する方法を設定します。

source: Sets the modification date (time will be midnight).
ja: 修正日を設定します（時刻は午前0時になります）。

source: Sets the modification time to the current time for all matching files.
ja: 一致するすべてのファイルの修正時刻を現在時刻に設定します。

source: Sets the mouse speed that will be used if unspecified in Click and MouseMove/Click/Drag.
ja: ClickおよびMouseMove/Click/Dragで指定されていない場合に使用されるマウスの速度を設定します。

source: Sets the mouse speed that will be used if unspecified in Click, MouseMove, MouseClick, and MouseClickDrag.
ja: SetDefaultMouseSpeed関数は、Click関数、MouseMove関数、MouseClick関数、MouseClickDrag関数で指定がない場合に使用されるマウスポインターの速度を設定します。

source: Sets the priority or interruptibility of threads.
ja: スレッドの優先順位や割り込み可能性を設定します。

source: Sets the registry view used by RegRead, RegWrite, RegDelete, RegDeleteKey and Loop Reg, allowing them in a 32-bit script to access the 64-bit registry view and vice versa.
ja: RegRead、RegWrite、RegDelete、RegDeleteKeyおよびLoop Regが使用するレジストリビューを設定し、32ビットスクリプトで64ビットレジストリビューにアクセスできるようにします（逆も同様）。

source: Sets the selection in a ListBox or ComboBox to be the first entry whose leading part matches the specified string.
ja: リストボックスまたはコンボボックスの選択範囲を、先頭部分が指定された文字列と一致する最初の項目に設定します。

source: Sets the selection in a ListBox, ComboBox or Tab control to be the Nth item.
ja: ListBox、ComboBox、またはTabコントロールの選択範囲をN番目の項目に設定します。

source: Sets the selection in a ListBox, ComboBox or Tab control to be the specified entry or tab number.
ja: リストボックス、コンボボックス、タブコントロールの選択範囲を、指定された項目またはタブ番号に設定します。

source: Sets the selection in a ListBox, DropDownList, ComboBox, or Tab control to be the specified value.
ja: ListBox、DropDownList、ComboBox、Tab コントロールの選択範囲を指定された値に設定します。

source: Sets the state of CapsLock.
ja: CapsLockの状態を設定します。

source: Sets the state of CapsLock/NumLock/ScrollLock.
ja: CapsLock/NumLock/ScrollLockの状態を設定します。

source: Sets the state of NumLock.
ja: NumLockの状態を設定します。

source: Sets the state of ScrollLock.
ja: ScrollLockの状態を設定します。

source: Sets the template to be selected by default.
ja: デフォルトで選択されるテンプレートを設定します。

source: Sets the typeface, size, style, and text color for subsequently created controls.
ja: 続いて作成されるコントロールの書体、サイズ、スタイル、テキストカラーを設定します。

source: Sets the window to be the last found window (though this is unnecessary in a GUI thread because it is done automatically), which allows functions such as WinGetStyle and WinSetTransparent to operate on it even if it is hidden (that is, DetectHiddenWindows is not necessary).
ja: ウィンドウを最後に見つかったウィンドウに設定します（ただし、GUIスレッドでは自動的に行われるため不要）。これにより、WinGetStyleや WinSetTransparentなどの関数が、ウィンドウが隠れていても操作できるようになります（つまり、DetectHiddenWindowsは不要です）。

source: Sets various options and styles for the appearance and behavior of the control.
ja: コントロールの外観や動作に関するさまざまなオプションやスタイルを設定します。

source: Sets various options and styles for the appearance and behavior of the window.
ja: ウィンドウの外観や動作に関するさまざまなオプションやスタイルを設定します。

source: Sets zero or more items.
ja: 0個以上の項目を設定する。

source: Setting NewEncoding to UTF-8-RAW or UTF-16-RAW is valid, but the -RAW suffix is ignored.
ja: NewEncodingにUTF-8-RAWまたはUTF-16-RAWを指定することは有効ですが、-RAW という接尾辞は無視されます。

source: Setting NewEncoding never causes a BOM to be added or removed, as the BOM is normally written to the file when it is first created.
ja: NewEncodingを設定しても、BOMが追加されたり削除されたりすることはありません。通常、BOMは最初にファイルを作成するときに書き込まれるためです。

source: Setting Default Options
ja: デフォルトのオプションを設定する

source: Setting a default value does not prevent an error from being thrown when the index is out of range.
ja: デフォルト値を設定しても、インデックスが範囲外である場合にエラーが発生することは防げません。

source: Setting an Edit control's text with Edit.Value or Edit.Text does not trigger the control's Change event, whereas GuiControl would trigger the control's g-label.
ja: EditコントロールのテキストをEdit.ValueまたはEdit.Textで設定しても、コントロールのChangeイベントは発生しませんが、GuiControlではコントロールのg-labelは発生します。

source: Setting array elements or items in a map or collection is similar to assigning a value to a variable.
ja: マップやコレクションに配列要素や項目を設定するのは、変数に値を代入するのと似ている。

source: Setting it to 1 also restores the "Open" menu item to the tray menu and enables the items in the main window's View menu such as "Lines most recently executed", which allows viewing of the script's source code and other info.
ja: 1に設定すると、トレイメニューに「開く」メニュー項目が復活し、メインウィンドウの「表示」メニューにある「最近実行した行」などの項目が有効になり、スクリプトのソースコードやその他の情報を見ることができるようになる。

source: Setting it to 1 does not prevent the main window from being shown by WinShow or inspected by ControlGetText or similar methods, but it does prevent the script's source code and other info from being exposed via the main window, except when one of the functions listed above is called by the script.
ja: 1に設定しても、WinShowでメイン・ウィンドウが表示されたり、ControlGetTextや同様のメソッドで検査されたりするのを防ぐことはできませんが、スクリプトのソース・コードやその他の情報がメイン・ウィンドウ経由で公開されるのを防ぐことができます。

source: Setting the capacity of the string buffer of a property, array element or map element is not supported; for binary data, use a Buffer object.
ja: プロパティ、配列要素、マップ要素の文字列バッファの容量設定には対応していません。バイナリデータの場合は、Bufferオブジェクトを使用してください。

source: Setting the default item makes that item's font bold (setting a default item in menus other than the tray menu is currently purely cosmetic).
ja: デフォルトの項目を設定すると、その項目のフォントが太くなります（トレイメニュー以外のメニューでデフォルトの項目を設定することは、現在のところ純粋な外観上の問題です）。

source: Setting the state image to zero removes the check box altogether.
ja: 状態画像をゼロに設定すると、チェックボックスは完全に削除される。

source: Setting the transparency level to 255 before using "Off" might avoid window redrawing problems such as a black background.
ja: "Off"を使用する前に透明度を255に設定すると、背景が黒くなるなどのウィンドウ再描画の問題を回避できるかもしれない。

source: Setting the transparency level to 255 before using Off might avoid window redrawing problems such as a black background.
ja: Offを使用する前に透明度を255に設定すると、背景が黒くなるなどのウィンドウ再描画の問題を回避できるかもしれない。

source: Setting this property does not affect a key's options, since the production of text depends on the active window's keyboard layout at the time the key is pressed.
ja: このプロパティを設定しても、キーのオプションには影響しません。なぜなら、テキストの生成は、キーが押された時点のアクティブウィンドウのキーボードレイアウトに依存するからです。

source: Setting this to true enables notifications for all keypresses which do not produce text, such as when pressing Left or Alt+F.
ja: Trueに設定すると Left または Alt+Fを押したときなど、テキストを生成しないすべてのキー入力に対して通知を行うことができます。

source: Settings changed by the auto-execute thread now become the default settings immediately (for threads launched after that point), rather than after 100 ms and then again when the auto-execute thread finishes.
ja: 自動実行スレッドによって変更された設定は、100ミリ秒後に自動実行スレッドが終了したときに再び開始されるのではなく、その時点以降に起動されたスレッドの場合、すぐに既定の設定になります。

source: Settings changed by the auto-execute thread now become the default settings immediately (for threads launched after that point), rather than after 100ms and then again when the auto-execute thread finishes.
ja: 自動実行スレッドによって変更された設定は、100ms後に自動実行スレッドが終了したときに再び変更されるのではなく、（それ以降に起動したスレッドの）デフォルト設定に即座に変更されるようになりました。

source: Several changes have been made to the Control parameter used by the Control functions, SendMessage and PostMessage:
ja: Control関数、SendMessageとPostMessageで使用されるControlパラメータにいくつかの変更が加えられました：

source: Shares delete access.
ja: 削除アクセスを共有します。

source: Shares read access.
ja: 読み取りアクセスを共有します。

source: Shares write access.
ja: 書き込みアクセスを共有します。

source: Sharing mode flags are ignored and the file or stream represented by the handle is not checked for a byte order mark.
ja: 共有モードフラグは無視され、ハンドルが表すファイルまたはストリームはバイトオーダーマークをチェックしない。

source: ShellExecute can be used instead.
ja: 代わりにShellExecuteが使える。

source: Short answer:
ja: 回答：

source: Short answer: Save the script as UTF-8, preferably with BOM.
ja: 回答：スクリプトの文字コードをUTF-8、できればBOM付きで保存してください。

source: Short date representation for the current user's locale, such as 02/29/04
ja: 現在のユーザーのロケールに対応した短い日付表現（例：02/29/04）

source: Short-circuit Boolean Evaluation
ja: 簡略化されたブーリアン評価

source: Short-circuiting operates by refusing to evaluate parts of an expression that cannot possibly affect its final result.
ja: ショートサーキットは、式の最終結果に影響を与える可能性のない部分の評価を拒否することで動作します。

source: ShortPathName := A_LoopFileShortPath ; Will yield something similar to C:\MYDOCU~1\ADDRES~1.txt
ja: ShortPathName := A_LoopFileShortPath ; C:\MYDOCU~1\ADDRES~1.txt のような結果になります。

source: Shortcuts (.lnk files) are selected as-is rather than being resolved to their targets.
ja: ショートカット（.lnkファイル）は、ターゲットに解決されるのではなく、そのまま選択されます。

source: Shorthand for RegExMatch.
ja: RegExMatchの省略形。

source: Shorthand for Match["N"], where N is any unquoted name or number which does not conflict with a defined property (listed above).
ja: Match["N"]の略記で、Nは定義されたプロパティ（上記一覧）と衝突しない任意の引用されていない名前または数字です。

source: Show a message box describing the warning.
ja: 警告の内容を説明するメッセージボックスを表示します。

source: Show code
ja: コードを表示

source: Show or hide the alt-tab menu.
ja: alt-tabメニューの表示／非表示を切り替える。

source: Show the debugger pane via the toolbar or Plugins, DBGp, Debugger.
ja: ツールバーまたはプラグイン、DBGp、デバッガーから、デバッガーペインを表示します。

source: ShowContextMenu(LV, Item, IsRightClick, X, Y) ; In response to right-click or Apps key.
ja: ShowContextMenu(LV, Item, IsRightClick, X, Y) ; 右クリックまたはAppsキーに応答します。

source: ShowG() { ; The warning is displayed even if the function is never called.
ja: ShowG() { ; 関数が一度も呼び出されない場合でも警告は表示されます。

source: Shows a checkmark in the row (if the ListView has checkboxes).
ja: ListViewにチェックボックスがある場合）行にチェックマークを表示します。

source: Shows a disabled vertical scroll bar for the list box when the box does not contain enough items to scroll.
ja: リストボックスにスクロールするのに十分な項目がない場合に、無効な垂直スクロールバーを表示する。

source: Shows a disabled vertical scroll bar in the drop-down list when it does not contain enough items to scroll.
ja: ドロップダウンリストにスクロールするのに十分な項目がない場合、無効な垂直スクロールバーを表示します。

source: Shows a large-icon view but with ergonomic differences such as displaying each item's text to the right of the icon rather than underneath it.
ja: 大きなアイコンで表示されますが、各項目のテキストがアイコンの下ではなく右側に表示されるなど、人間工学的な違いがあります。

source: Shows a menu containing help files and online documentation for v1 and v2, and any other CHM files found in the installation directory.
ja: v1とv2のヘルプファイルとオンライン・ドキュメント、およびインストール・ディレクトリにあるその他のCHMファイルを含むメニューを表示します。

source: Shows a menu of the first n files matching a pattern, and their icons.
ja: パターンにマッチする最初のn個のファイルとそのアイコンのメニューを表示する。

source: Shows a message box if a file does not exist.
ja: ファイルが存在しない場合、メッセージボックスを表示します。

source: Shows a message box if a folder does not exist.
ja: フォルダが存在しない場合、メッセージボックスを表示します。

source: Shows a message box if a folder does exist.
ja: フォルダが存在する場合は、メッセージボックスを表示します。

source: Shows a message box if at least one program folder does exist.
ja: 少なくとも1つのプログラムフォルダーが存在する場合、メッセージボックスを表示します。

source: Shows a message box if at least one text file does exist in a directory.
ja: ディレクトリに少なくとも1つのテキストファイルが存在する場合、メッセージボックスを表示します。

source: Shows a message box if the D drive does exist.
ja: Dドライブが存在する場合、メッセージボックスを表示します。

source: Shows a message box with default text.
ja: デフォルトのテキストでメッセージボックスを表示します。

source: Shows a message box with specific text and a title.
ja: 特定のテキストとタイトルを含むメッセージボックスを表示します。

source: Shows a message box with specific text, a title and an info icon.
ja: 特定のテキスト、タイトル、情報アイコンを含むメッセージボックスが表示されます。

source: Shows a message box with specific text.
ja: 特定のテキストを含むメッセージボックスを表示します。

source: Shows a message box with the supplied text, for debugging purposes.
ja: デバッグ用に、指定したテキストでメッセージボックスを表示する。

source: Shows a multiline balloon message or toast notification for 20 seconds near the tray icon without playing the notification sound.
ja: 通知音を再生せずに、トレイアイコンの近くに20秒間、複数行のバルーンメッセージまたはトースト通知を表示します。

source: Shows a multiline tooltip at a specific position in the active window.
ja: アクティブウィンドウの特定の位置に複数行のツールチップを表示する。

source: Shows different uses for IsSet and IsSetRef.
ja: IsSetとIsSetRefの使い分けを紹介しています。

source: Shows directive debugging text.
ja: ディレクティブのデバッグテキストを表示する。

source: Shows how to detect the type of EXE and operating system on which the script is running.
ja: スクリプトが実行されているEXEの種類とオペレーティングシステムを検出する方法を示しています。

source: Shows how to set a specific registry view, and how registry redirection affects the script.
ja: 特定のレジストリビューを設定する方法、およびレジストリリダイレクトがスクリプトに与える影響について示します。

source: Shows in detail how this variable causes vkFF to be sent instead of LControl.
ja: この変数によって、LControlの代わりにvkFFが送信される仕組みを詳しく説明します。

source: Shows one difference between VerCompare and StrCompare.
ja: VerCompareとStrCompareの違いを1つ示す。

source: Shows the GUI instead of immediately compiling.
ja: すぐにコンパイルする代わりにGUIを表示する。

source: Shows the HWND, class name, title and controls of the window currently under the mouse cursor.
ja: マウスカーソルがあるウィンドウのHWND、クラス、タイトル、コントロールを表示します。

source: Shows the bounding coordinates of the second monitor in a message box.
ja: 第2モニタの境界座標をメッセージボックスに表示します。

source: Shows the drop-down list of a ComboBox control.
ja: ComboBox コントロールのドロップダウンリストを表示します。

source: Shows the specified control if it was previously hidden.
ja: 指定されたコントロールが以前に非表示になっていた場合、それを表示します。

source: Shows the window without activating it.
ja: ウィンドウをアクティブにせずに表示します。

source: Shutdown - Syntax & Usage | AutoHotkey v2
ja: Shutdown - 構文と使用法｜AutoHotkey v2

source: Shuts down, restarts, or logs off the system.
ja: システムのシャットダウン、再起動、ログオフを行います。

source: Sidebar visibility:
ja: サイドバーの視認性：

source: Signals the occurrence of an error.
ja: エラーの発生を通知します。

source: Signed decimal integer.
ja: 符号付き10進数整数。

source: Signed value that has the form [ - ]d.dddd e [sign]dd[d] where d is one decimal digit, dddd is one or more decimal digits, dd[d] is two or three decimal digits depending on the output format and size of the exponent, and sign is + or -.
ja: 符号付き値で，形式は [ - ]d.dddde[sign]dd[d]ここで，dは小数点以下1桁，ddddは小数点以下1桁以上，dd[d]は出力形式と指数の大きさに応じて小数点以下2桁または3桁，signは + または -。

source: Signed value that has the form [ - ]dddd.dddd, where dddd is one or more decimal digits.
ja: 符号付き値で、[ - ]dddd.dddd（ddddは1桁以上の10進数）の形式を持つ。

source: Signed values are displayed in f or e format, whichever is more compact for the given value and precision.
ja: 符号付き値は、fまたはeのフォーマットで表示され、与えられた値と精度に対してよりコンパクトなほうを選択します。

source: Silver
ja: Silver（銀色）

source: Similar to CBS_DROPDOWN, except that the edit control is replaced by a static text item that displays the current selection in the list box.
ja: CBS_DROPDOWNと似ていますが、エディットコントロールがリストボックスの現在の選択項目を表示する静的なテキストアイテムに置き換えられる点が異なります。

source: Similar to CBS_SIMPLE, except that the list box is not displayed unless the user selects an icon next to the edit control.
ja: CBS_SIMPLEと似ているが、ユーザーがエディットコントロールの隣にあるアイコンを選択しない限り、リストボックスは表示されない。

source: Similar to GroupActivate except activates the next window not in the group.
ja: GroupActivateと似ていますが、グループ内にない次のウィンドウをアクティブにします。

source: Similar to AutoHotkey v1's Transform HTML, this function converts a string into its HTML equivalent by translating characters whose ASCII values are above 127 to their HTML names (e.g. £ becomes &pound;).
ja: AutoHotkey v1のTransform HTMLと同様に、この関数は、ASCII値が127以上の文字をHTML名に変換することで、文字列をHTMLに相当するものに変換します（例えば、£は &pound;になります）。

source: Similar to AutoHotkey v1's Transform Deref, the following function expands variable references and escape sequences contained inside other variables.
ja: AutoHotkey v1のTransform Derefと同様に、他の変数内に含まれる変数参照やエスケープシーケンスを展開する機能を以下に示します。

source: Similar to above but ignores artificial keystrokes and/or mouse clicks whenever the corresponding hook (keyboard or mouse) is installed; that is, it responds only to physical events.
ja: 上記と似ているが、対応するフック（キーボードまたはマウス）がインストールされているときはいつでも、人工的なキーストロークやマウスクリックを無視する。

source: Similarly, "UInt*" passes the address of a 32-bit number, so should not be used if the function expects an array of values or a structure larger than 32 bits.
ja: 同様に、「UInt*」は32ビット数値のアドレスを渡すので、関数が値の配列や32ビットより大きな構造体を期待する場合は使用しないでください。

source: Similarly, A_NowUTC contains the current Coordinated Universal Time.
ja: 同様に、A_NowUTCには、現在の協定世界時（Coordinated Universal Time）が格納されます。

source: Similarly, RegExReplace allows the substring that matches each subpattern to be reinserted into the result via backreferences like $1.
ja: 同様に、RegExReplaceでは、各サブパターンにマッチする部分文字列を、$1のような後方参照を通じて結果に再挿入することができる。

source: Similarly, "*C:\My Folder" would initially select that particular folder.
ja: 同様に、"*C:\My Folder"は、その特定のフォルダを初期選択します。

source: Similarly, A_Space A_Tab would start a new substring every time a space or tab is encountered in the input string.
ja: 同様に、A_Space A_Tabは、入力文字列の中でスペースやタブに遭遇するたびに新しい部分文字列を開始します。

source: Similarly, A_Tab A_Space would start a new substring every time a space or tab is encountered in the input string.
ja: 同様に、A_Tab A_Spaceは、入力文字列の中でスペースやタブに遭遇するたびに新しい部分文字列を開始します。

source: Similarly, [A_Space, A_Tab] would create a new array element every time a space or tab is encountered in the input string.
ja: 同様に、[A_Space, A_Tab]は、入力文字列中にスペースやタブが出現するたびに新しい配列要素を作成する。

source: Similarly, obj.unk := value invokes __Set and obj.unk() invokes __Call.
ja: 同様に、obj.unk := valueは __Setを起動し、obj.unk()は__Callを起動します。

source: Similarly, ++Var := X is evaluated as ++(Var := X); and Z>0 ? X:=2 : Y:=2 is evaluated as Z>0 ? (X:=2) : (Y:=2).
ja: 同様に、++Var := Xは ++(Var := X)と評価され、Z>0 ? X:=2 : Y:=2はZ>0 ? (X:=2) : (Y:=2)と評価される。

source: Similarly, Join| inserts a pipe between lines.
ja: 同様に、Join|は行間にパイプを挿入する。

source: Similarly, Var .= "abc" is a shorthand way of writing Var := Var . "abc".
ja: 同様に、Var .= "abc"は、Var := Var . "abc"である。

source: Similarly, (?<=...) and (?<!...) are positive and negative look-behinds (respectively) because they look to the left of the current position rather than the right.
ja: 同様に、(?<=...)と(?<!...)は、それぞれ正と負のルックビハインドである。なぜなら、彼らは現在位置の右ではなく左を見るからである。

source: Similarly, [^0-9xyz] matches any single character that isn't a digit and isn't the letter x, y, or z.
ja: 同様に、[^0-9xyz]は、数字でなく、文字x、y、zでない一文字にマッチする。
